# GetBoundaryLoops Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedFace..::..GetBoundaryLoops Method
TessellatedFace Class See Also
---
Get loops bounding the face.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public IList<IList<XYZ>> GetBoundaryLoops()
```

Visual Basic
---
```text
Public Function GetBoundaryLoops As IList(Of IList(Of XYZ))
```

Visual C++
---
```text
public:
IList<IList<XYZ^>^>^ GetBoundaryLoops()
```

# See Also
TessellatedFace Class
Autodesk.Revit.DB Namespace